tutorials/incompressibleFluid/drivaerFastback/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [kinematicPressure];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    freestream
    {
        type            freestreamPressure;
        freestreamValue uniform 0;
        value           uniform 0;
    }

    wall
    {
        type            zeroGradient;
    }

    processor
    {
        type            processor;
        value           uniform 0;
    }
}

// ************************************************************************* //
