tutorials/incompressibleFluid/drivaerFastback/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

xMin   -10;
xMax    30;
yMin   -5;
yMax    5;
zMin    0;
zMax    8;
xCells  40;
yCells  10;
zCells  8;

vertices
(
    ($xMin $yMin $zMin)
    ($xMax $yMin $zMin)
    ($xMax $yMax $zMin)
    ($xMin $yMax $zMin)

    ($xMin $yMin $zMax)
    ($xMax $yMin $zMax)
    ($xMax $yMax $zMax)
    ($xMin $yMax $zMax)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($xCells $yCells $zCells) simpleGrading (1 1 1)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 7 4)
        );
    }

    freestream
    {
        type patch;
        faces
        (
            (1 5 6 2)
            (4 7 6 5)
            (3 2 6 7)
            (0 4 5 1)
        );
    }

    ground
    {
        type wall;
        faces
        (
            (0 1 2 3)
        );
    }
);


// ************************************************************************* //
